name = "Даниил" # Это называется переменная, переменная это коробка которая хранит в себе данные
# а так мы создали программу с переменными age и name которые хранят в себе данные Даниил и 22
# то есть по простому переменная это коробка с информацией к примеру с текстом, числом и тд
age = "22"
print("my name is", name)
print("my age", age)
s = "danil"
# Python умеет делать простые вычисления не только print(5-2), но и с переменными
a = 15 # Переменная a в ней хранится 15
b = 5 # Переменная b в ней хранится 5
result = a - b # Переменная result в ней хранится переменная a - переменная b
print("Сумма", result)

resultat = a + b # Так же как и выше только не с вычетание, а со сложением.
print("Вычитание", resultat)

resultik = a * b # Умножение
print("Умножение", resultik)

resultatos = a / b # Деление
print("Деление", resultatos)
 
# ИЛи можно сделать проще
print("сумма", a + b)
print("ВЫчитание", a - b)
print("Умножение", a * b)

z = input("как тебя зовут?")
x = input("Из какого ты города?")
c = input("А где ты живёшь сейча?")
print("Привет", z)
print("из города", x)
print("ты родился в", c)

v = input("назови первую цифру") # ПЕРЕМЕННАЯ V С данными которые ты сам вводишь
n = input("назови вторую цифру")
print("сумма этих чисел равна", v + n)
print("Вычитание этих цифр равно", v - n)
print("умножение этих числе равно", v * n)
print("Деление этих чисел равно", v / n)