a = int(input("ВВедите первое целое число"))
b = int(input("Введите второе целое число"))

print("Сумма ваших чисел", a + b)
print("Разность ваших числе равна", a - b)
print("Произведение ваших чисел равно", a * b)
print("Деление ваших чисел равно", a / b)
print("Спасибо, что воспользовались нашим калькулятором, возвращайтесь ещё!!!")



z = float(input("ВВедите первое целое число"))
x = float(input("Введите второе целое число"))

print("Сумма ваших чисел", z + x)
print("Разность ваших числе равна", z - x)
print("Произведение ваших чисел равно", z * x)
print("Деление ваших чисел равно", z / x)
print("Спасибо, что воспользовались нашим калькулятором, возвращайтесь ещё!!!")