# ковычки могут быть и ' и ", главное чтобы они в начале и в конце строки были одинаковые
print("А", "a")# После запятой нужен пробел, это не ошибка, это чтобы код был читабельный
print("Если в тексте нужны'ковычки на выводе'то ставим их внутри ковычек")
#Если внутри ковычек нужеы двойные то весь текст внутри ординарной и наоборот.
#То есть команда print используется для вывода на экран
 # В print значения через (,) называются аргументами
 #Команда print выводит данные команда input считывает данные
a = 10
print("jfas'FD' fas")
print('fsa"fsa"fsa')